
// 2008

"kDiscoveringDevicesKey"					= "Etsitään Bluetooth-laitteita…";
"kDiscoveryCompleteKey"						= "Etsiminen suoritettu.";
"kBluetoothIsOffKey"						= "Tämän tietokoneen Bluetooth on pois päältä. Laita Bluetooth päälle, niin voit jatkaa.";
"kErrorDiscoveringDevicesKey"				= "Laitteita etsittäessä tapahtui virhe.";

"kOptionsKey"								= "Valinnat";
"kStopKey"									= "Lopeta";
"kStartKey"									= "Aloita";
"kShowKey"									= "Näytä";
"kAllDevicesKey"							= "Kaikki laitteet";
"kLaptopsKey"								= "Kannettavat";
"kClearListKey"								= "Tyhjennä luettelo";
"kAudioDevicesKey"							= "Äänilaitteet";

"kConfiguringServicesKey"					= "Määritellään palveluita";
"kPasskeySelectionKey"						= "Pääsykoodin valinta";
"kNumDevicesFoundKey"						= "Etsitään laitteita - %@ löytynyt.";
"kAutomaticPairAttemptKey"					= "Tietokone yrittää automaattisesti muodostaa parin laitteen kanssa.";

"kSpecifyDeviceKey"							= "Määrittele laite…";

"kDeviceList_MouseDevicesKey"				= "HIIRET";
"kDeviceList_KeyboardDevicesKey"			= "NÄPPÄIMISTÖT";
"kDeviceList_MobilePhoneDevicesKey"			= "MATKAPUHELIMET";
"kDeviceList_AudioDevicesKey"				= "ÄÄNI";
"kDeviceList_OtherDevicesKey"				= "MUUT";
"kDeviceList_ComputerDevicesKey"			= "TIETOKONE";

"kDeviceList_NoDevicesFoundKey"				= "Laitteita ei löytynyt";

"kPair_Device_PairingAttemptFailedInvalidSoftwareKey"	= "Parinmuodostus epäonnistui. Tämä Mac OS X:n ja Bluetooth-ohjelmiston määrittely saattaa olla virheellinen tai ei-tuettu.";
"kPairAttemptFailed3Key"								= "Parinmuodostus epäonnistui. Jos haluat käyttää eri pääsykoodia tai parinmuodostusmenetelmää, osoita Pääsykoodivalinnat…. Jos haluat yrittää uudelleen, osoita Jatka.";

"kAlreadyPairedWithThatDeviceTitleStringKey"			= "Tietokone muodostaa jo parin kohteen ”%@” kanssa.";
"kAlreadyPairedWithThatDeviceExplanationStringKey"		= "Tietokone muodostaa jo parin kyseisen laitteen kanssa. Haluatko poistaa parin ja ottaa laitteen käyttöön uudelleen?";

//============================== Pair Panel =============================//

"kPairingFailed"							= "Parinmuodostus epäonnistui";

// === prior to 2008

// Panel Titles.

"kIntroductionKey"							= "Esittely";
"kSetupDecisionKey"							= "Valitse laitetyyppi";
"kConclusionKey"							= "Yhteenveto";

"kKeyboardSetupTitleKey"					= "Bluetooth-näppäimistön asennus";
"kMouseSetupTitleKey"						= "Bluetooth-hiiren asennus";
"kMouseTrackpadSetupTitleKey"				= "Bluetooth-hiiren tai -ohjauslevyn asennus";
"kDeviceSetupTitleKey"						= "Bluetooth-laitteen asennus";
"kPhoneSetupTitleKey"						= "Bluetooth-matkapuhelimen asennus";
"kPrinterSetupTitleKey"						= "Bluetooth-tulostimen käyttöönotto";
"kHeadsetSetupTitleKey"						= "Bluetooth-kuulokemikrofonin käyttöönotto";

// Misc stuff.

"kAreYouSureYouWantToQuitKey"				= "Haluatko varmasti lopettaa käyttöönottoapurin?";
"kAreYouSureYouWantToQuitExplanationKey"	= "Jos lopetat nyt, käyttöönottoapuri on aloitettava alusta.";
"kUsersKeyboardKey"							= "Näppäimistö (%@)";
"kUsersMouseKey"							= "Hiiri (%@)";
"kUsersTrackpadKey"							= "Ohjauslevy: %@";
"kRootUsersKeyboardKey"						= "ylläpitäjän näppäimistö";
"kRootUsersMouseKey"						= "ylläpitäjän hiiri";

"kSetUpAnotherDeviceButtonKey"				= "Ota käyttöön toinen laite";
"kAdvancedPasskeyOptionsButtonKey"			= "Pääsykoodivalinnat…";
"kOtherKey"									= "Muu";
"kGenericKey"								= "Yleinen";

// Buttons.

"kOKButtonKey"								= "OK";
"kOpeniSyncButtonKey"						= "Avaa iSync";
"kCancelButtonKey"							= "Kumoa";
"kContinueButtonKey"						= "Jatka";
"kIgnoreButtonKey"							= "Älä huomioi";
"kSkipButtonKey"							= "Ohita";
"kQuitButtonKey"							= "Lopeta";
"kNeedAuthenticationTitleKey"				= "Sinun on todentauduttava, jotta voit tehdä määritellyt muutokset.";
"kNeedAuthenticationExplanationKey"			= "Jotta voit muuttaa internetin käyttöasetuksia, sinun on todentauduttava ylläpitäjäksi tällä tietokoneella. Poista asetuksen valinta tai osoita Jatka ja yritä todentauduttava uudelleen.";

// Device types.

"kMobilePhoneCapsKey"						= "Matkapuhelin";
"kMobilePhonesCapsKey"						= "Matkapuhelimet";
"kMobilePhoneKey"							= "matkapuhelin";
"kMobilePhonesKey"							= "matkapuhelimet";
"kDeviceKey"								= "Laite";
"kDevicesKey"								= "Laitteet";
"kMouseKey"									= "Hiiri";
"kTrackpadKey"								= "Ohjauslevy";
"kMiceKey"									= "Hiiret";
"kKeyboardKey"								= "Näppäimistö";
"kKeyboardsKey"								= "Näppäimistöt";
"kPrinterKey"								= "Tulostin";
"kPrintersKey"								= "Tulostimet";
"kHeadsetKey"								= "Kuulokemikrofoni";
"kHeadphonesKey"							= "Kuulokkeet";
"kHeadsetsKey"								= "Kuulokemikrofonit";
"kComputerKey"								= "Tietokone";
"kComputersKey"								= "Tietokoneet";
"kPDAKey"									= "Kämmenlaite";
"kLANAccessPointKey"						= "LAN-tukiasema";
"kTypeKey"									= "Tyyppi";

// Services panel

"kServicesPanel_DeviceNameKey"				= "Laitenimi: ";
"kServicesPanel_DeviceAddressKey"			= "Laiteosoite: ";
"kServicesPanel_DeviceTypeKey"				= "Laitetyyppi: ";
"kServicesPanel_DeviceServicesKey"			= "Laitepalvelut: ";

"kSetupServicesPanel_PhoneTitleKey"			= "Valitse palvelut, joita haluat käyttää matkapuhelimen kanssa:";
"kSetupServicesPanel_DeviceTitleKey"		= "Valitse palvelut, joita haluat käyttää laitteen kanssa:";

"kSetupServicesPanel_ConfiguringServicesKey"		=	"Määritellään palveluita…";

"kServicesPanel_GatheringInformationTitleKey"		=	"Kerätään lisätietoja laitteesta";
"kServicesPanel_GatheringInformationExplanationKey"	=	"Tietokone tarvitsee tietoja laitteesta voidakseen kommunikoida sen kanssa. Tämän pitäisi kestää vain pari sekuntia.";
"kServicesPanel_GatheringInformationUnknownErrorKey"=	"Kerättäessä tietoja laitteesta tapahtui tuntematon virhe. Varmista, että laite on tietokoneen kantaman sisällä, päällä ja ”löydettävissä”. Yritä uudelleen osoittamalla Jatka.";
"kServicesPanel_GatheringInformationSDPErrorKey"	=	"Haettaessa käytettävissä olevia palveluita laitteesta tapahtui virhe. Varmista, että laite on tietokoneen kantaman sisällä, päällä ja ”löydettävissä”. Yritä uudelleen osoittamalla Jatka.";
"kServicesPanel_GatheringInformationStatusKey"		=	"Kerätään lisätietoja laitteesta…";
"kServicesPanel_GatheringInformationSuccessKey"		=	"Lisätietojen kerääminen suoritettu.";

// Intro Panel.

"kWelcomeToTheSetUpAssistantKey"			= "Tervetuloa Bluetoothin käyttöönottoapuriin.";
"kWelcomeMachineHasBluetoothKey"			= "Kun laite tulee näkyviin luetteloon, valitse se ja osoita Jatka. Jos laitetta ei näy luettelossa, varmista, että se on päällä ja ”löydettävissä”. Lisätietoja löytyy laitteen mukana tulleesta dokumentaatiosta.";
"kWelcomeMachineDoesNotHaveBluetoothKey"	= "Tietokoneelta ei löytynyt sopivaa Bluetooth-laitteistoa tai -ohjelmistoa. Jos olet asentanut Bluetooth-laitteiston hiljattain, varmista, että se on yhdistetty oikein.\n\nKun olet varmistanut, että Bluetooth-laitteisto on yhdistetty oikein, voit jatkaa.";

//============================== Discovery Panel =============================//

// Discovery Panel (General)

"kDiscovery_Gen_ErrorOccurredSearchingKey"					= "Etsintää suoritettaessa tapahtui virhe.";
"kDiscovery_Gen_UpdatingDeviceNamesSingleKey"				= "Päivitetään laitteen nimeä…";
"kDiscovery_Gen_UpdatingDeviceNamesMultipleKey"				= "Päivitetään %@ laitteen nimiä…";

// Mouse HID (HIDless) panel

"kHIDLess_MouseInstructionTextKey"							= "Yhtään hiirtä ei ole yhdistetty.";
"kHIDLess_MouseSmallInstructionTextKey"						= "Bluetoothin käyttöönottoapuri etsii Bluetooth-hiirtä. Jos sellainen löytyy, tietokone muodostaa sen kanssa parin. Tarkista kaapelit, jos aiot käyttää USB-hiirtä.\n\nJos yrität käyttää Bluetooth-hiirtä eikä sitä löydy, varmista, että se on kytketty päälle ja ”löydettävissä”. Kytke Applen langaton hiiri päälle liu'uttamalla hiiren pohjassa olevaa kytkintä. Jos yrität käyttää jonkun muun kuin Applen valmistamaa langatonta hiirtä, lue hiiren mukana tulleet ohjeet.";
"kHIDLess_MouseAttemptingToConnectTextKey"					= "Yritetään yhdistää hiiri nro %@ (%@)…";
"kHIDLess_MouseClickContinueButtonTextKey"					= "Parin muodostus hiiren kanssa onnistui. Varmista onnistunut parinmuodostus osoittamalla hiirellä Jatka-painiketta. Jos hiiren osoitin ei liiku ja toinen langaton hiiri on lähistöllä käytettävissä, tietokone yrittää ehkä muodostaa paria toisen hiiren kanssa.\n\nBluetoothin käyttöönottoapuri yrittää parinmuodostusta uudelleen %@ sekunnin kuluttua.";
"kHIDLess_MouseClickContinueButton2TextKey"					= "Parin muodostus hiiren kanssa onnistui. Varmista onnistunut parinmuodostus osoittamalla hiirellä Jatka-painiketta. Jos hiiren osoitin ei liiku ja toinen langaton hiiri tai ohjauslevy on lähistöllä käytettävissä, tietokone yrittää ehkä muodostaa paria toisen langattoman hiiren tai ohjauslevyn kanssa.\n\nTietokone yrittää parinmuodostusta uudelleen %@ sekunnin kuluttua.";
"kHIDLess_MouseWaitingForPairingAckTextKey"					= "Osoita Jatka (%@ sekuntia)…";
"kHIDLess_MousePairingFailed1TextKey"						= "Parinmuodostus hiiren kanssa epäonnistui. Tietokone yrittää uudelleen saman hiiren kanssa 5 sekunnin kuluttua…";
"kHIDLess_MousePairingFailed2TextKey"						= "Parinmuodostus hiiren kanssa epäonnistui. Muodostetaan pari seuraavan langattoman hiiren tai ohjauslevyn kanssa…";


// Mouse or Trackpad HID (HIDless) panel
"kHIDLess_MouseTrackpadInstructionTextKey"					= "Yhtään langatonta hiirtä tai ohjauslevyä ei ole yhdistetty.";
"kHIDLess_MouseTrackpadSmallInstructionTextKey"				= "Etsitään langatonta hiirtä tai ohjauslevyä. Jos sellainen löytyy, tietokone muodostaa sen kanssa parin. Tarkista kaapelit, jos aiot käyttää USB-hiirtä.\n\nJos yrität käyttää langatonta hiirtä tai ohjauslevyä eikä sellaista löydy, varmista, että se on kytketty päälle ja ”löydettävissä”. Jos käytät Applen langatonta hiirtä tai ohjauslevyä, kytke hiiri tai ohjauslevy päälle. Jos yrität käyttää jonkun muun kuin Applen valmistamaa langatonta hiirtä tai ohjauslevyä, lue hiiren tai ohjauslevyn mukana tulleet ohjeet.";
"kHIDLess_TrackpadAttemptingToConnectTextKey"				= "Yritetään yhdistää ohjauslevy nro %@ (%@)…";
"kHIDLess_TrackpadClickContinueButtonTextKey"				= "Parin muodostus ohjauslevyn kanssa onnistui. Varmista onnistunut parinmuodostus osoittamalla  Jatka-painiketta ohjauslevyä käyttäen. Jos ohjauslevyn osoitin ei liiku ja toinen langaton hiiri tai ohjauslevy on lähistöllä käytettävissä, tietokone yrittää ehkä muodostaa paria toisen langattoman hiiren tai ohjauslevyn kanssa.\n\nTietokone yrittää parinmuodostusta uudelleen %@ sekunnin kuluttua.";
"kHIDLess_TrackpadPairingFailed1TextKey"					= "Parinmuodostus ohjauslevyn kanssa epäonnistui. Tietokone yrittää uudelleen saman ohjauslevyn kanssa 5 sekunnin kuluttua…";
"kHIDLess_TrackpadPairingFailed2TextKey"					= "Parinmuodostus ohjauslevyn kanssa epäonnistui. Muodostetaan pari seuraavan langattoman hiiren tai ohjauslevyn kanssa…";


// Keyboard HID (HIDless) panel

"kHIDLess_KeyboardInstructionTextKey"						= "Yhtään langatonta näppäimistöä ei ole yhdistetty.";
"kHIDLess_KeyboardSmallInstructionDiscoveringTextKey"		= "Bluetoothin käyttöönottoapuri etsii Bluetooth-näppäimistöä. Jos sellainen löytyy, tietokone muodostaa sen kanssa parin. Tarkista kaapelit, jos aiot käyttää USB-näppäimistöä.\n\nJos yrität käyttää Bluetooth-näppäimistöä eikä sitä löydy, varmista, että se on kytketty päälle ja ”löydettävissä”. Jos käytät Applen langatonta näppäimistöä, kytke näppäimistö päälle. Jos yrität käyttää jonkun muun kuin Applen valmistamaa langatonta näppäimistöä, lue näppäimistön mukana tulleet ohjeet.";
"kHIDLess_KeyboardSmallInstructionDiscovering2TextKey"		= "Etsitään langatonta näppäimistöä. Jos sellainen löytyy, tietokone muodostaa sen kanssa parin. Tarkista kaapelit, jos aiot käyttää USB-näppäimistöä.\n\nJos yrität käyttää langatonta näppäimistöä eikä sitä löydy, varmista, että se on kytketty päälle ja ”löydettävissä”. Jos käytät Applen langatonta näppäimistöä, kytke näppäimistö päälle. Jos yrität käyttää jonkun muun kuin Applen valmistamaa langatonta näppäimistöä, lue näppäimistön mukana tulleet ohjeet.";
"kHIDLess_KeyboardSmallInstructionPairingTextKey"			= "Kirjoita seuraava pääsyavain näppäimistöllä, jota olet asentamassa ja paina rivinvaihtonäppäintä:\n\n\n\n\n\nKun olet syöttänyt pääsyavaimen, parin muodostus on valmis.";
"kHIDLess_KeyboardAttemptingToConnectTextKey"				= "Yhdistetään näppäimistöön %@ (%@)…";
"kHIDLess_KeyboardConnectedTextKey"							= "Yhteys muodostettu näppäimistöön %@ (%@).";
"kHIDLess_KeyboardTypeContinueButtonTextKey"				= "Parinmuodostus näppäimistön kanssa onnistui.\n\nPaina rivinvaihtonäppäintä, kun haluat jatkaa.";
"kHIDLess_KeyboardPairingAuthenticationFailedTextKey"		= "Tapahtui todentamisvirhe. Pääsykoodit eivät vastaa toisiaan.";
"kHIDLess_KeyboardPairingTimeoutTextKey"					= "Tapahtui aikakatkaisuvirhe. Varmista, että syötit pääsykoodin, ja paina rivinvaihtonäppäintä.";
"kHIDLess_KeyboardPairingAuthenticationFailed2TextKey"		= "Parinmuodostus näppäimistön kanssa epäonnistui. Tietokone yrittää uudelleen saman näppäimistön kanssa 5 sekunnin kuluttua…";
"kHIDLess_KeyboardPairingFailedTextKey"						= "Parinmuodostus näppäimistön kanssa epäonnistui. Tietokone yrittää uudelleen 5 sekunnin kuluttua…";

//============================== Pair Panel =============================//

"kDiscovery_Device_YouMustFindAndSelectBeforeContinuingKey"	= "Laite on valittava luettelosta ennen jatkamista.";
"kDiscovery_Device_NoDeviceSelectedKey"						= "Mitään laitetta ei ole valittuna.";

"kPair_Mouse_PairingAttemptSucceededKey"		= "Parinmuodostus tietokoneen ja hiiren välillä onnistui.";
"kPair_Trackpad_PairingAttemptSucceededKey"		= "Parinmuodostus tietokoneen ja ohjauslevyn välillä onnistui.";
"kPair_Keyboard_PairingAttemptSucceededKey"		= "Parinmuodostus tietokoneen ja näppäimistön välillä onnistui.";

// Pair Panel (General).

"kPair_General_NoDeviceStringKey"				= "Virhe: Mitään laitetta ei ole määritelty edellisessä ikkunassa.";
"kPair_General_PairingAttemptToPairKey"			= "Muodostetaan paria laitteen ”%@” kanssa.";
"kPair_General_ConnectingToDeviceKey"			= "Yhdistetään laitteeseen ”%@”.";
"kPair_General_ConnectionEstablishedKey"		= "Yhteys muodostettu.";

// Discovery Panel (mice)

"kDiscovery_Mouse_SearchingForDevicesKey"					= "Etsitään hiiriä - %@ löytynyt.";
"kDiscovery_Mouse_YouMustFindAndSelectBeforeContinuingKey"	= "Hiiri on valittava luettelosta ennen jatkamista.";
"kDiscovery_Mouse_NoDeviceSelectedKey"						= "Mitään hiirtä ei ole valittuna.";
"kDiscovery_Mouse_SmallInstructionTextKey"					= "Kun hiiri tulee näkyviin luetteloon, valitse se ja osoita Jatka. Jos hiirtä ei näy luettelossa, varmista, että hiiri on ”löydettävissä”. Jos käytät Applen langatonta hiirtä, kytke hiiri päälle liu'uttamalla hiiren pohjassa olevaa kytkintä.";
"kDiscovery_Mouse_NoFoundDevicesSoFarKey"					= "Yhtään hiirtä ei löytynyt. Varmista, että hiiri on löydettävissä.";
"kDiscovery_Mouse_BigInstructionTextKey"					= "Etsitään hiirtä";

// Discovery Panel (mice/trackpads)
"kDiscovery_Mouse_Trackpad_SearchingForDevicesKey"			= "Etsitään langattomia hiiriä ja ohjauslevyjä - %@ löytynyt.";
"kDiscovery_Mouse_Trackpad_NoFoundDevicesSoFarKey"			= "Yhtään langatonta hiirtä tai ohjauslevyä ei löytynyt. Varmista, että langaton hiiri tai ohjauslevy on ”löydettävissä”.";


// Discovery Panel (keyboards)

"kDiscovery_Keyboard_SearchingForDevicesKey"					= "Etsitään näppäimistöjä - %@ löytynyt.";
"kDiscovery_Keyboard_YouMustFindAndSelectBeforeContinuingKey"	= "Näppäimistö on valittava luettelosta ennen jatkamista.";
"kDiscovery_Keyboard_NoDeviceSelectedKey"						= "Mitään näppäimistöä ei ole valittuna.";
"kDiscovery_Keyboard_SmallInstructionTextKey"					= "Kun näppäimistö tulee näkyviin luetteloon, valitse se ja osoita Jatka. Jos näppäimistöä ei näy luettelossa, varmista, että näppäimistö on ”löydettävissä”. Jos käytät Applen langatonta näppäimistöä, kytke se päälle.";
"kDiscovery_Keyboard_NoFoundDevicesSoFarKey"					= "Yhtään näppäimistöä ei löytynyt. Varmista, että näppäimistö on löydettävissä.";
"kDiscovery_Keyboard_BigInstructionTextKey"						= "Etsitään näppäimistöä";


// Pair Panel (SSP Numeric Comparison).

"kPair_SSPNumCmp_StatusExplanationTextKey"		= "Voit jatkaa parinmuodostusta varmistamalla, että alla oleva numero näkyy laitteessa, jonka kanssa parinmuodostusta suoritetaan.";
"kPair_SSPNumCmp_StatusTextKey"					= "Jos tämä numero näkyy toisessa laitteessa, viimeistele parinmuodostus osoittamalla Jatka. Jos se ei näy, yritä uudelleen osoittamalla Takaisin.";

// Pair Panel (SSP Passkey Notification).

"kPair_SSPPassNotif_StatusExplanationTextKey"	= "Voit jatkaa parinmuodostusta kirjoittamalla alla olevan numeron laitteeseen, jonka kanssa parinmuodostusta suoritetaan, ja painamalla rivinvaihtonäppäintä.";

// Pair Panel (Other Devices).

"kPair_Device_BigTitleTextKey"					= "Muodostetaan paria Bluetooth-laitteen kanssa";
"kPair_Device_InstructionTextKey"				= "Laite saattaa pyytää sinua syöttämään pääsykoodin. Tarkista, onko laite valmis vastaanottamaan pääsykoodin. Kun laite on valmis, syötä seuraava pääsykoodi:\n\n\n\n\nKun olet syöttänyt pääsykoodin laitteeseen, parin muodostus on suoritettu.";
"kPair_Device_ClickContinueToSetupKey"			= "Asenna laitteellesi saatavilla olevat palvelut osoittamalla Jatka.";
"kPair_Device_PairingAttemptFailed1Key"			= "Parin muodostus laitteen kanssa epäonnistui. Yritä uudelleen osoittamalla Jatka.";
"kPair_Device_PairingAttemptFailed2Key"			= "Parinmuodostus epäonnistui. Varmista, että laite on tietokoneen kantaman sisällä, päällä ja ”löydettävissä”. Kun olet valmis, yritä uudelleen osoittamalla Jatka.";
"kPair_Device_PairingAttemptFailed3Key"			= "Parinmuodostus epäonnistui. Jos käytät pääsykoodia, varmista, että syötit sen oikein laitteeseen. Kun olet valmis, yritä uudelleen osoittamalla Jatka.";
"kPair_Device_PairingAttemptFailed18Key"		= "Parinmuodostus epäonnistui. Laite ei hyväksy parinmuodostusyritystä. Lisätietoja löydät laitteen mukana tulleista ohjeista. Kun olet valmis, yritä uudelleen osoittamalla Jatka.";
"kPair_Device_PairingAttemptSucceededKey"		= "Parinmuodostus tietokoneen ja laitteen välillä onnistui.";
"kPair_Device_AlreadyPairedKey"					= "Tietokone ja laite muodostavat jo parin.";
"kPair_Device_GatheringServiceInformationKey"	= "Kerätään huoltotietoja laitteestasi.";
"kPair_Device_GatheringInformationKey"			= "Kerätään lisätietoja laitteestasi.";
"kPair_Device_EmptyPasskeyInstructionTextKey"	= "Tietokone muodostaa parin laitteen kanssa tyhjää pääsyavainta käyttäen.";

//============================== Dial up Panel =============================//

"kDialupErrorSavingNetworkTitleTextKey"			= "Verkkomäärittelyiden tallennus epäonnistui.";
"kDialupErrorSavingNetworkExplanationTextKey"	= "Bluetooth-verkkoasetuksia ei voitu tallentaa.";
"kDialupErrorSavingSerialTitleTextKey"			= "Verkkomäärittelyiden tallennus epäonnistui.";
"kDialupErrorSavingSerialExplanationTextKey" 	= "Verkkomäärittelyiden muutosten tallennus epäonnistui.";

//============================== Internet Access Panel =============================//

"kInternetAccess_InstructionTitleKey"				= "Jos haluat käyttää laitetta internet-yhteyteen, sinun on syötettävä seuraavat tiedot.";
"kInternetAccess_UserNameTextFieldLabelKey"			= "Käyttäjätunnus:";
"kInternetAccess_PasswordTextFieldLabelKey"			= "Salasana:";
"kInternetAccess_APNTextFieldLabelKey"				= "APN:";
"kInternetAccess_PhoneNumberTextFieldLabelKey"		= "Puhelinnro:";
"kInternetAccess_GPRSExampleKey"					= "Esimerkiksi: *99*123456789#";
"kInternetAccess_NoBluetoothNetworkInterfaceKey"	= "Bluetoothin käyttöönottoapuri ei voi ottaa laitetta käyttöön modeemina, koska Bluetooth-liitäntä ei ole käytettävissä. Avaa Verkko-asetukset ja lisää se.";

//============================== conclusion Panel =============================//

"kCheckMarkCharacterKey"							= "√";
"kBulletCharacterKey"								= "•";
"kConclusionPanelUseISyncKey"						= "Käytä iSyncia yhteystietojen ja tapahtumien siirtämiseen";
"kConclusionPanelUseFileTransferKey"				= "Käytä tiedostojen siirtämiseen";
"kConclusionPanelUseAddressBookKey"					= "Käytä Osoitekirjan kanssa";
"kConclusionPanelUseAsHIDDeviceKey"					= "Käytä tämän tietokoneen syöttölaitteena";
"kConclusionPanelUseInternetKey"					= "Käytä internetiä";
"kConclusionPanelUseSerialPortKey"					= "Luotiin tietokoneen sarjaportti";
"kConclusionPanelUseAsPANDeviceKey"					= "Käytä lähiverkkona";
"kConclusionPanelUseAsAudioOutputKey"				= "Käytä äänen ulostulolaitteena";
"kConclusionPanelUseAsAudioInputKey"				= "Käytä äänen sisäänmenolaitteena";
"kConclusionPanelDevicePairedKey"					= "Parinmuodostus suoritettu";
"kConclusionPanelNoSupportedServicesWereFoundKey"	= "Laitteesta ei löytynyt tuettuja palveluita.";
"kConclusionPanelFailedNoServicesTitleKey"			= "Bluetooth-laitetta ei ole määritelty toimimaan tietokoneen kanssa.";

//============================== General conclusion Panel =============================//

"kConclusionPanelPhoneSummaryTitleKey"		= "Tietokone ja matkapuhelin on määritelty seuraavalla tavalla:";
"kConclusionPanelDeviceSummaryTitleKey"		= "Tietokone ja laite on määritelty seuraavalla tavalla:";

"kConclusionPanelMobilePhoneSetupKey"		= "Matkapuhelimesi on nyt määritelty käyttämään tietokoneen Bluetooth-ominaisuuksia.";
"kConclusionPanelKeyboardSetupKey"			= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-näppäimistöä.";
"kConclusionPanelMouseSetupKey"				= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-hiirtä.";
"kConclusionPanelTrackpadSetupKey"			= "Onneksi olkoon! Tietokoneesi on nyt määritelty käyttämään Bluetooth-ohjauslevyä.";	
"kConclusionPanelOtherDeviceKey"			= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-laitetta.";
"kConclusionPanelKeyboardAndMouseKey"		= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-näppäimistöä ja -hiirtä.";
"kConclusionPanelPrinterSetupKey"			= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-tulostinta.";
"kConclusionPanelHeadsetSetupKey"			= "Tietokoneesi on nyt määritelty käyttämään Bluetooth-kuuloketta.";
"kConclusionPanelAppleHeadsetSetupKey"		= "Tietokone on nyt määritelty käyttämään iPhonen Bluetooth-kuulokemikrofonia.";
"kConclusionPanelAppleiPhoneSetupKey"		= "Tietokone on nyt määritelty käyttämään iPhonea.";
"kConclusionPanelMouseSetupSkippedKey"		= "Tietokoneeseen on kytketty hiiri. Bluetooth-yhteyden muodostaminen ei ole enää tarpeellista.";
"kConclusionPanelMouseTrackpadSetupSkippedKey"	= "Tietokoneeseen on kytketty hiiri. Bluetooth-hiiren tai -ohjauslevyn käyttöönotto ei ole enää tarpeellista.";
"kConclusionPanelKeyboardSetupSkippedKey"	= "Tietokoneeseen on kytketty näppäimistö. Bluetooth-yhteyden muodostaminen ei ole enää tarpeellista.";
"kConclusionPanelSetupInterruptedKey"		= "Laitteen käyttöönotto keskeytyi.";
"kConclusionPanelHeadsetsNotSupportedKey"	= "Käyttöönottoapuri ei voinut määritellä kuulokemikrofonia. Yritä ottaa se käyttöön uudelleen.";
"kConclusionPanelFailedSetupErrorKey"		= "Otettaessa laitetta käyttöön tapahtui virhe (0x%x). Yritä uudelleen.";
"kConclusionPanelFailedNoServicesTextKey"	= "Laitteesta ei löytynyt määriteltäviä palveluita. Tämä voi johtua siitä, että palvelut eivät ole käytössä laitteessa tai että laitteessa ei ole palveluita, jotka pitää määritellä tietokoneella. Lisätietoja saat laitteen mukana tulleesta dokumentaatiosta.";
"kConclusionPanelNoServicesConfiguredTextKey"	= "Yhtään käytettävissä olevista palveluista ei määritelty Bluetooth-laitettasi varten.";
"kConclusionPanelUseAssistantAgainToChangeKey"	= "Muuta asetuksia käyttöönottoapurin avulla.";


